<a href="https://colab.research.google.com/github/AngelineLawrence/Machine-Learning/blob/master/Pandas_Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
#pandas can take in dictionary datatype and convert them as Dataframes
dict={"Name":['Mark','Luke','John'],"Age":[28,34,30],"Phone":['1213412342','2356347873','6572349081']}

In [0]:
#convert to dataframe, displays it with its own index if none are provided
data=pd.DataFrame(dict)
print(data)
data

   Name  Age       Phone
0  Mark   28  1213412342
1  Luke   34  2356347873
2  John   30  6572349081

   Name  Age       Phone
0  Mark   28  1213412342
1  Luke   34  2356347873
2  John   30  6572349081

In [0]:
#Setting index
data.index=['0','1','2']
data

   Name  Age       Phone
0  Mark   28  1213412342
1  Luke   34  2356347873
2  John   30  6572349081

In [0]:
#reading csv
#data2=pd.reas_csv('csv file / cloud url',index_col=0)

#Retrieve columns from dataframe
print(data['Name'])
print(data[['Name','Phone']])
print(data[['Name','Phone','Age']])

0    Mark
1    Luke
2    John
Name: Name, dtype: object
   Name       Phone
0  Mark  1213412342
1  Luke  2356347873
2  John  6572349081
   Name       Phone  Age
0  Mark  1213412342   28
1  Luke  2356347873   34
2  John  6572349081   30

In [0]:
#Printing rows/observstions
data[0:1]#prints the first record

   Name  Age       Phone
0  Mark   28  1213412342

In [0]:
#Labelled Indexing
data.loc['0']

Name           Mark
Age              28
Phone    1213412342
Name: 0, dtype: object

In [0]:
#Integer Indexing
data.iloc[0]

Name           Mark
Age              28
Phone    1213412342
Name: 0, dtype: object

In [0]:
#Label Indexing: Row values
data.loc[['0','1']]

   Name  Age       Phone
0  Mark   28  1213412342
1  Luke   34  2356347873

In [0]:
#Integer Indexing: Row values
data.iloc[['0','1']]

   Name  Age       Phone
0  Mark   28  1213412342
1  Luke   34  2356347873

In [0]:
#Integer Indexing iloc

#All rows(:) [comma separated Index of the columns]
print(data.iloc[:,[1,2]])

#Row numbers 1 & 2
print(data.iloc[[1,2]])

#All rows except the last one , [Comma separated Index of columns]
print(data.iloc[:-1,[1,2]])

   Age       Phone
0   28  1213412342
1   34  2356347873
2   30  6572349081
   Name  Age       Phone
1  Luke   34  2356347873
2  John   30  6572349081
   Age       Phone
0   28  1213412342
1   34  2356347873

In [0]:
#Adding Columns with data

#As a list
address_list=['Texas','New York','Seattle']

#As a dict
address_dict={'Texas':'Mark','New York':'Luke', 'Seattle':'John'}

data['Address_dict']=address_dict
data['Address_list']=address_list

In [0]:
data

   Name  Age       Phone Address_dict Address_list
0  Mark   28  1213412342        Texas        Texas
1  Luke   34  2356347873     New York     New York
2  John   30  6572349081      Seattle      Seattle

In [0]:
#Adding a column
data["Hourly Salary"]=[30,28,34]

#Change Name of a column



#.columns
print("data.columns :")
print(data.columns)

#.head(n) Displays first n rows
print("data.head() :")
print(data.head())

#.tail(n) Displays last n rows
print("data.tail() : ")
print(data.tail())

#.describe Retuens Statistical Details about the data
print("data.describe() :")
print(data.describe())

#.info()
print("data.info():")
print(data.info())

#.mean()
print("data.mean() : ")
print(data.mean())

#.min()
print("data.min() : ")
print(data.min())

#.max()
print("data.max() : ")
print(data.max())

#.median()
print("data.median() : ")
print(data.median())

#.mode()
print("data.mode() : ")
print(data.mode())

#.corr Correlation between columns in the dataframe
print("data.corr() :")
print(data.corr())

data.columns :
Index(['Name', 'Age', 'Phone', 'Address_dict', 'Address_list',
       'Hourly Salary'],
      dtype='object')
data.head() :
   Name  Age       Phone Address_dict Address_list  Hourly Salary
0  Mark   28  1213412342        Texas        Texas             30
1  Luke   34  2356347873     New York     New York             28
2  John   30  6572349081      Seattle      Seattle             34
data.tail() :
   Name  Age       Phone Address_dict Address_list  Hourly Salary
0  Mark   28  1213412342        Texas        Texas             30
1  Luke   34  2356347873     New York     New York             28
2  John   30  6572349081      Seattle      Seattle             34
data.describe() :
             Age  Hourly Salary
count   3.000000       3.000000
mean   30.666667      30.666667
std     3.055050       3.055050
min    28.000000      28.000000
25%    29.000000      29.000000
50%    30.000000      30.000000
75%    32.000000      32.000000
max    34.000000      34.000000
data.info():
<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 0 to 2
Data columns (total 6 columns):
Name             3 non-null object
Age              3 non-null int64
Phone            3 non-null object
Address_dict     3 non-null object
Address_list     3 non-null object
Hourly Salary    3 non-null int64
dtypes: int64(2), object(4)
memory usage: 248.0+ bytes
None
data.mean() :
Age              30.666667
Hourly Salary    30.666667
dtype: float64
data.min() :
Name                   John
Age                      28
Phone            1213412342
Address_dict       New York
Address_list       New York
Hourly Salary            28
dtype: object
data.max() :
Name                   Mark
Age                      34
Phone            6572349081
Address_dict          Texas
Address_list          Texas
Hourly Salary            34
dtype: object
data.median() :
Age              30.0
Hourly Salary    30.0
dtype: float64
data.mode() :
   Name  Age       Phone Address_dict Address_list  Hourly Salary
0  John   28  1213412342     New York     New York             28
1  Luke   30  2356347873      Seattle      Seattle             30
2  Mark   34  6572349081        Texas        Texas             34
data.corr() :
               Age  Hourly Salary
Age            1.0           -0.5
Hourly Salary -0.5            1.0

In [0]:
#Merging Dataframes

dict2={"Name":['James','Paul','Peter'],"Age":[38,24,40],"Phone":['121325622342','92536347873','65723491531']}
address_dict={'Texas':'Paul','New York':'James', 'Seattle':'Peter'}
address_list=['Texas','New York','Seattle']
data2=pd.DataFrame(dict2)
data2["Address_dict"]=address_dict
data2["Address_list"]=address_list
data2["Hourly Salary"]=[50,82,45]
data2

#Merge Portion
Merged_data=pd.concat([data,data2], ignore_index=True)
Merged_data

#Merge Variants, optional arguments
#Merged_data=pd.merge([data,data2], on='Col_name, Eg: Address_list', how='inner/outer/..', left_on='Col_name', right_on='Col_name')
#data.join(data2,on='col_name',how='inner')â€Š

    Name  Age         Phone Address_dict Address_list  Hourly Salary
0   Mark   28    1213412342        Texas        Texas             30
1   Luke   34    2356347873     New York     New York             28
2   John   30    6572349081      Seattle      Seattle             34
3  James   38  121325622342        Texas        Texas             50
4   Paul   24   92536347873     New York     New York             82
5  Peter   40   65723491531      Seattle      Seattle             45

In [0]:
#Group By
print(Merged_data.groupby(['Address_list']).mean())
print(Merged_data.groupby(['Address_list','Age']).mean())

#Sorting Values, Sorts the entire dataframe based on the column selected
print(Merged_data.sort_values('Age'))
print(Merged_data.sort_values('Age').mean())

               Age  Hourly Salary
Address_list
New York      29.0           55.0
Seattle       35.0           39.5
Texas         33.0           40.0
                  Hourly Salary
Address_list Age
New York     24              82
             34              28
Seattle      30              34
             40              45
Texas        28              30
             38              50
    Name  Age         Phone Address_dict Address_list  Hourly Salary
4   Paul   24   92536347873     New York     New York             82
0   Mark   28    1213412342        Texas        Texas             30
2   John   30    6572349081      Seattle      Seattle             34
1   Luke   34    2356347873     New York     New York             28
3  James   38  121325622342        Texas        Texas             50
5  Peter   40   65723491531      Seattle      Seattle             45
Age              32.333333
Hourly Salary    44.833333
dtype: float64